In [1]:
import pandas as pd

In [7]:
# Bringing in the WS Data

win_share_df = pd.read_csv("../Datasets/win_share.csv") 
win_share_df = win_share_df[['Player', 'WS']]
win_share_df

                     Player    WS
0                A.C. Green  94.6
1             A.J. Bramlett  -0.2
2              A.J. English   1.1
3               A.J. Guyton   0.3
4              A.J. Hammons   0.0
...                     ...   ...
3277  Šarūnas Marčiulionis*   3.8
3278              Žan Tabak   2.4
3279        Žarko ?abarkapa  -0.1
3280          Žarko Paspalj  -0.3
3281         Željko Rebra?a   7.7

[3282 rows x 2 columns]

In [9]:
# Bringing in the Hometown Data
hometown_df = pd.read_csv("../nba_hometown_data.csv") 

hometown_df.rename(columns = {'birth_state':'Birth_Place'}, inplace = True) 

hometown_df

                 Player             Birth_Place
0          Cliff Barker                 Indiana
1           Ralph Beard                Kentucky
2         Charlie Black                   Idaho
3           Nelson Bobb            Pennsylvania
4       Jake Bornheimer              New Jersey
...                 ...                     ...
3434      Troy Williams          South Carolina
3435       Kyle Wiltjer                  Oregon
3436  Stephen Zimmerman               Tennessee
3437        Paul Zipser                 Germany
3438        Ivica Zubac  Bosnia and Herzegovina

[3439 rows x 2 columns]

In [16]:
heatmap_df = pd.merge(win_share_df, hometown_df, on='Player', how = 'inner')
heatmap_df

                  Player    WS Birth_Place
0           Aaron Brooks  15.1  Washington
1           Aaron Gordon  21.8  California
2             Aaron Gray   5.1  California
3         Aaron Harrison  -0.2       Texas
4            Aaron James   8.1   Louisiana
...                  ...   ...         ...
2702       Zach Randolph  78.3     Indiana
2703     Zaid Abdul-Aziz   0.4    New York
2704       Zaza Pachulia  52.6     Georgia
2705     Zendon Hamilton   3.0    New York
2706  Zydrunas Ilgauskas  66.4   Lithuania

[2707 rows x 3 columns]

In [18]:
heatmap_df = heatmap_df[['Birth_Place', 'WS']]
heatmap_df

     Birth_Place    WS
0     Washington  15.1
1     California  21.8
2     California   5.1
3          Texas  -0.2
4      Louisiana   8.1
...          ...   ...
2702     Indiana  78.3
2703    New York   0.4
2704     Georgia  52.6
2705    New York   3.0
2706   Lithuania  66.4

[2707 rows x 2 columns]

In [22]:
heatmap_df = heatmap_df.groupby(['Birth_Place']).sum().reset_index()
heatmap_df

       Birth_Place      WS
0          Alabama  1291.3
1           Alaska    28.5
2        Argentina    93.2
3          Arizona   100.6
4         Arkansas   714.4
..             ...     ...
111       Virginia  1006.8
112     Washington   779.2
113  West Virginia    83.2
114      Wisconsin   438.4
115        Wyoming    23.1

[116 rows x 2 columns]

In [20]:
heatmap_df.to_csv('../Datasets/birthplace_ws.csv', index=False)

In [27]:
for index, row in heatmap_df.iterrows():
        heatmap = {
            'birthplace': row['Birth_Place'],
            'win_shares': row['WS'],
        }

In [28]:
heatmap

{'birthplace': 'Wyoming', 'win_shares': 23.099999999999998}